#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <getopt.h>


void help_me(){
	printf("РЎРїСЂР°РІРєР° РїРѕ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЋ:\nРћРїС†РёСЏ -i <РїРµСЂРµРјРµРЅРЅР°СЏ> РёР»Рё --info <РїРµСЂРµРјРµРЅРЅР°СЏ> РІС‹РІРѕРґРёС‚ Р·РЅР°С‡РµРЅРёРµ СѓРєР°Р·Р°РЅРЅРѕР№ РїРµСЂРµРјРµРЅРЅРѕР№.\n");
	printf("РћРїС†РёСЏ -s <РїРµСЂРµРјРµРЅРЅР°СЏ=Р·РЅР°С‡РµРЅРёРµ> РёР»Рё --set <РїРµСЂРµРјРµРЅРЅР°СЏ=Р·РЅР°С‡РµРЅРёРµ> РїСЂРёСЃРІР°РёРІР°РµС‚ СѓРєР°Р·Р°РЅРЅРѕР№ РїРµСЂРµРјРµРЅРЅРѕР№ РѕРєСЂСѓР¶РµРЅРёСЏ РЅРѕРІРѕРµ Р·РЅР°С‡РµРЅРёРµ.\n");
	printf("РћРїС†РёСЏ -a <РїРµСЂРµРјРµРЅРЅР°СЏ> РёР»Рё --assign <РїРµСЂРµРјРµРЅРЅР°СЏ> Рё -v <Р·РЅР°С‡РµРЅРёРµ> РёР»Рё --value <Р·РЅР°С‡РµРЅРёРµ> РїСЂРёСЃРІР°РёРІР°РµС‚ СѓРєР°Р·Р°РЅРЅРѕР№ РїРµСЂРµРјРµРЅРЅРѕР№ РѕРєСЂСѓР¶РµРЅРёСЏ РЅРѕРІРѕРµ Р·РЅР°С‡РµРЅРёРµ.\n");
	printf("РћРїС†РёСЏ -d РёР»Рё --del <РїРµСЂРµРјРµРЅРЅР°СЏ> СѓРґР°Р»СЏРµС‚ СѓРєР°Р·Р°РЅРЅСѓСЋ РїРµСЂРµРјРµРЅРЅСѓСЋ РёР· РѕРєСЂСѓР¶РµРЅРёСЏ.\n");
	printf("РћРїС†РёСЏ -СЃ РёР»Рё --clear РїРѕР»РЅРѕСЃС‚СЊСЋ РѕС‡РёС‰Р°РµС‚ РѕРєСЂСѓР¶РµРЅРёРµ.\n");
}

void  info_environ(char *opt){
	char *env = getenv(opt);
	if (env == NULL){
		printf("Р”Р°РЅРЅРѕР№ РїРµСЂРµРјРµРЅРЅРѕР№ РІ РѕРєСЂСѓР¶РµРЅРёРё РЅРµС‚...\n");	
	}
	else{
		printf("%s\n", env);
	} 
}

void set_environ(int flag, char *arg1, char *arg2){
	if (flag == 1){
		printf("РЎР»РёС€РєРѕРј РјР°Р»Рѕ Р°СЂРіСѓРјРµРЅС‚РѕРІ...\n");
		printf("Р—Р°РїСѓСЃРє РїСЂРѕРіСЂР°РјРјС‹ РґРѕР»Р¶РµРЅ РІС‹РіР»СЏРґРµС‚СЊ С‚Р°Рє:\n");
		printf("./environ <РїРµСЂРµРјРµРЅРЅР°СЏ> <Р·РЅР°С‡РµРЅРёРµ>\n");
	}else{
		if (setenv (arg1, arg2, 1) != 0){
			printf("РќРµРІРѕР·РјРѕР¶РЅРѕ СѓСЃС‚Р°РЅРѕРІРёС‚СЊ Р·РЅР°С‡РµРЅРёРµ РґР»СЏ РїРµСЂРµРјРµРЅРЅРѕР№ %s\n", arg1);
		}
		printf("%s = %s\n", arg1, getenv(arg1));	
	}
}

void delete_environ(char *opt){
	if (unsetenv(opt) != 0)
        	printf("РќРµРІРѕР·РјРѕР¶РЅРѕ СѓРґР°Р»РёС‚СЊ РїРµСЂРµРјРµРЅРЅСѓСЋ %s\n", opt);
	else
		printf("РџРµСЂРµРјРµРЅРЅР°СЏ СѓРґР°Р»РµРЅР° \n");
}

void printenv(){
	extern char **environ;
	int i;
	for (i = 0; environ[i] != NULL; i++){
	    printf("%s\n", environ[i]);
	}
}

void clear_environ(){
	extern char **environ;
	clearenv();	
}

void set_new(int a, int v, char *opt1, char *opt2){
	if (a == 1 && v == 1){
		if (setenv (opt1, opt2, 1) != 0){
			  printf("РќРµРІРѕР·РјРѕР¶РЅРѕ СѓСЃС‚Р°РЅРѕРІРёС‚СЊ Р·РЅР°С‡РµРЅРёРµ РґР»СЏ РїРµСЂРµРјРµРЅРЅРѕР№ %s\n", opt1);
		}
		printf("%s = %s\n", opt1, getenv(opt1));
	}
	if (a == 1 && v == 0){
		if (setenv (opt1, "", 1) != 0){
			  printf("РќРµРІРѕР·РјРѕР¶РЅРѕ СѓСЃС‚Р°РЅРѕРІРёС‚СЊ Р·РЅР°С‡РµРЅРёРµ РґР»СЏ РїРµСЂРµРјРµРЅРЅРѕР№ %s\n", opt1);
		}
		printf("%s = %s\n", opt1, getenv(opt1));	
	}

	if (a == 0 && v ==1){
		printf("РћС€РёР±РєР° РІС‹РїРѕР»РЅРµРЅРёСЏ....\n");
	}
}
